#### Terraform Staging Format and Style 🖌 `success`
#### Terraform Staging Initialization ⚙️ `success`
#### Terraform Staging Validation 🤖 `success`
<details><summary>Staging Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Staging Plan 📖 `success`

<details><summary>Show Staging Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.databricks_current_user.service_principal: Reading...
data.databricks_current_user.service_principal: Read complete after 3s [id=122301935360490]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_job.batch_inference_job will be created
  + resource "databricks_job" "batch_inference_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "staging-mlops-demo-batch-inference-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "master"
          + provider = "gitHub"
          + url      = "https://github.com/renepajta/mlops-demo"
        }

      + new_cluster {
          + custom_tags                  = {
              + "clusterSource" = "mlops-stack/0.0"
            }
          + data_security_mode           = "SINGLE_USER"
          + driver_instance_pool_id      = (known after apply)
          + driver_node_type_id          = (known after apply)
          + enable_elastic_disk          = (known after apply)
          + enable_local_disk_encryption = (known after apply)
          + node_type_id                 = "Standard_D3_v2"
          + num_workers                  = 3
          + single_user_name             = "56c579d6-2bb2-453e-91f2-1155eab620f1"
          + spark_version                = "11.0.x-cpu-ml-scala2.12"
        }

      + notebook_task {
          + base_parameters = {
              + "env"               = "staging"
              + "input_table_name"  = "mlopsdemo_input"
              + "output_table_name" = "mlopsdemo_predictions"
            }
          + notebook_path   = "notebooks/BatchInference"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 11 * * ?"
          + timezone_id            = "UTC"
        }
    }

  # databricks_job.model_training_job will be created
  + resource "databricks_job" "model_training_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "staging-mlops-demo-model-training-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "master"
          + provider = "gitHub"
          + url      = "https://github.com/renepajta/mlops-demo"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "Train"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "staging"
                }
              + notebook_path   = "notebooks/Train"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "TriggerModelDeploy"

          + depends_on {
              + task_key = "Train"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + data_security_mode           = "SINGLE_USER"
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "Standard_D3_v2"
              + num_workers                  = 3
              + single_user_name             = "56c579d6-2bb2-453e-91f2-1155eab620f1"
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "staging"
                }
              + notebook_path   = "notebooks/TriggerModelDeploy"
            }
        }
    }

  # databricks_mlflow_experiment.experiment will be created
  + resource "databricks_mlflow_experiment" "experiment" {
      + creation_time    = (known after apply)
      + description      = "MLflow Experiment used to track runs for mlops-demo project."
      + experiment_id    = (known after apply)
      + id               = (known after apply)
      + last_update_time = (known after apply)
      + lifecycle_stage  = (known after apply)
      + name             = "/mlops-demo/staging-mlops-demo-experiment"
    }

  # databricks_mlflow_model.registered_model will be created
  + resource "databricks_mlflow_model" "registered_model" {
      + creation_timestamp     = (known after apply)
      + description            = (known after apply)
      + id                     = (known after apply)
      + last_updated_timestamp = (known after apply)
      + name                   = "staging-mlops-demo-model"
      + registered_model_id    = (known after apply)
      + user_id                = (known after apply)
    }

  # databricks_permissions.batch_job_permissions will be created
  + resource "databricks_permissions" "batch_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "mlops-stack-readers"
          + permission_level = "CAN_VIEW"
        }
    }

  # databricks_permissions.mlflow_experiment_permissions will be created
  + resource "databricks_permissions" "mlflow_experiment_permissions" {
      + experiment_id = (known after apply)
      + id            = (known after apply)
      + object_type   = (known after apply)

      + access_control {
          + group_name       = "mlops-stack-readers"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.mlflow_model_permissions will be created
  + resource "databricks_permissions" "mlflow_model_permissions" {
      + id                  = (known after apply)
      + object_type         = (known after apply)
      + registered_model_id = (known after apply)

      + access_control {
          + group_name       = "mlops-stack-readers"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.training_job_permissions will be created
  + resource "databricks_permissions" "training_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "mlops-stack-readers"
          + permission_level = "CAN_VIEW"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mlops-demo_batch_inference_job_id = (known after apply)
  + mlops-demo_experiment_id          = (known after apply)
  + mlops-demo_experiment_name        = "/mlops-demo/staging-mlops-demo-experiment"
  + mlops-demo_model_name             = "staging-mlops-demo-model"
  + mlops-demo_training_job_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>